tako0910/py32f0-template/Libraries/CMSIS/Device/PY32F0xx/Source/gcc/startup_py32f032.s
/**
  ******************************************************************************
  * @file      startup_py32f032.s
  * @brief     PY32F032 devices vector table for GCC toolchain.
  ******************************************************************************
  */

  .syntax unified
  .cpu cortex-m0plus
  .fpu softvfp
  .thumb

.global g_pfnVectors
.global Default_Handler

.word _sidata
.word _sdata
.word _edata
.word _sbss
.word _ebss

  .section .text.Reset_Handler
  .weak Reset_Handler
  .type Reset_Handler, %function
Reset_Handler:
  ldr   r0, =_estack
  mov   sp, r0

  ldr r0, =_sdata
  ldr r1, =_edata
  ldr r2, =_sidata
  movs r3, #0
  b LoopCopyDataInit

CopyDataInit:
  ldr r4, [r2, r3]
  str r4, [r0, r3]
  adds r3, r3, #4

LoopCopyDataInit:
  adds r4, r0, r3
  cmp r4, r1
  bcc CopyDataInit

  ldr r2, =_sbss
  ldr r4, =_ebss
  movs r3, #0
  b LoopFillZerobss

FillZerobss:
  str  r3, [r2]
  adds r2, r2, #4

LoopFillZerobss:
  cmp r2, r4
  bcc FillZerobss

  bl  SystemInit
  bl  __libc_init_array
  bl  main

LoopForever:
  b LoopForever

.size Reset_Handler, .-Reset_Handler

  .section .text.Default_Handler,"ax",%progbits
Default_Handler:
Infinite_Loop:
  b Infinite_Loop
  .size Default_Handler, .-Default_Handler

  .section .isr_vector,"a",%progbits
  .type g_pfnVectors, %object
  .size g_pfnVectors, .-g_pfnVectors

g_pfnVectors:
  .word  _estack
  .word  Reset_Handler
  .word  NMI_Handler
  .word  HardFault_Handler
  .word  0
  .word  0
  .word  0
  .word  0
  .word  0
  .word  0
  .word  0
  .word  SVC_Handler
  .word  0
  .word  0
  .word  PendSV_Handler
  .word  SysTick_Handler
  .word  WWDG_IRQHandler
  .word  PVD_IRQHandler
  .word  RTC_IRQHandler
  .word  FLASH_IRQHandler
  .word  RCC_IRQHandler
  .word  EXTI0_1_IRQHandler
  .word  EXTI2_3_IRQHandler
  .word  EXTI4_15_IRQHandler
  .word  ADC_IRQHandler
  .word  DMA1_Channel1_IRQHandler
  .word  DMA1_Channel2_IRQHandler
  .word  DMA1_Channel3_IRQHandler
  .word  COMP1_2_IRQHandler
  .word  TIM1_BRK_UP_TRG_COM_IRQHandler
  .word  TIM1_CC_IRQHandler
  .word  0
  .word  TIM3_IRQHandler
  .word  LPTIM1_IRQHandler
  .word  0
  .word  TIM14_IRQHandler
  .word  0
  .word  TIM16_IRQHandler
  .word  TIM17_IRQHandler
  .word  I2C1_EV_IRQHandler
  .word  I2C1_ER_IRQHandler
  .word  SPI1_IRQHandler
  .word  SPI2_IRQHandler
  .word  USART1_IRQHandler
  .word  UART1_IRQHandler
  .word  LPUART1_IRQHandler
  .word  0
  .word  0

  .weak      NMI_Handler
  .thumb_set NMI_Handler,Default_Handler
  .weak      HardFault_Handler
  .thumb_set HardFault_Handler,Default_Handler
  .weak      SVC_Handler
  .thumb_set SVC_Handler,Default_Handler
  .weak      PendSV_Handler
  .thumb_set PendSV_Handler,Default_Handler
  .weak      SysTick_Handler
  .thumb_set SysTick_Handler,Default_Handler
  .weak      WWDG_IRQHandler
  .thumb_set WWDG_IRQHandler,Default_Handler
  .weak      PVD_IRQHandler
  .thumb_set PVD_IRQHandler,Default_Handler
  .weak      RTC_IRQHandler
  .thumb_set RTC_IRQHandler,Default_Handler
  .weak      FLASH_IRQHandler
  .thumb_set FLASH_IRQHandler,Default_Handler
  .weak      RCC_IRQHandler
  .thumb_set RCC_IRQHandler,Default_Handler
  .weak      EXTI0_1_IRQHandler
  .thumb_set EXTI0_1_IRQHandler,Default_Handler
  .weak      EXTI2_3_IRQHandler
  .thumb_set EXTI2_3_IRQHandler,Default_Handler
  .weak      EXTI4_15_IRQHandler
  .thumb_set EXTI4_15_IRQHandler,Default_Handler
  .weak      ADC_IRQHandler
  .thumb_set ADC_IRQHandler,Default_Handler
  .weak      DMA1_Channel1_IRQHandler
  .thumb_set DMA1_Channel1_IRQHandler,Default_Handler
  .weak      DMA1_Channel2_IRQHandler
  .thumb_set DMA1_Channel2_IRQHandler,Default_Handler
  .weak      DMA1_Channel3_IRQHandler
  .thumb_set DMA1_Channel3_IRQHandler,Default_Handler
  .weak      COMP1_2_IRQHandler
  .thumb_set COMP1_2_IRQHandler,Default_Handler
  .weak      TIM1_BRK_UP_TRG_COM_IRQHandler
  .thumb_set TIM1_BRK_UP_TRG_COM_IRQHandler,Default_Handler
  .weak      TIM1_CC_IRQHandler
  .thumb_set TIM1_CC_IRQHandler,Default_Handler
  .weak      TIM3_IRQHandler
  .thumb_set TIM3_IRQHandler,Default_Handler
  .weak      LPTIM1_IRQHandler
  .thumb_set LPTIM1_IRQHandler,Default_Handler
  .weak      TIM14_IRQHandler
  .thumb_set TIM14_IRQHandler,Default_Handler
  .weak      TIM16_IRQHandler
  .thumb_set TIM16_IRQHandler,Default_Handler
  .weak      TIM17_IRQHandler
  .thumb_set TIM17_IRQHandler,Default_Handler
  .weak      I2C1_EV_IRQHandler
  .thumb_set I2C1_EV_IRQHandler,Default_Handler
  .weak      I2C1_ER_IRQHandler
  .thumb_set I2C1_ER_IRQHandler,Default_Handler
  .weak      SPI1_IRQHandler
  .thumb_set SPI1_IRQHandler,Default_Handler
  .weak      SPI2_IRQHandler
  .thumb_set SPI2_IRQHandler,Default_Handler
  .weak      USART1_IRQHandler
  .thumb_set USART1_IRQHandler,Default_Handler
  .weak      UART1_IRQHandler
  .thumb_set UART1_IRQHandler,Default_Handler
  .weak      LPUART1_IRQHandler
  .thumb_set LPUART1_IRQHandler,Default_Handler
